#  Создайте несколько переменных разных типов. Проверьте к какому типу
# относятся созданные переменные.
a = 2
b = 2.01
c = 'Hi'
print(type(a))
print(type(b))
print(type(c))
