'''
Напишите программу, которая решает квадратные уравнения даже если дискриминант
отрицательный. Используйте комплексные числа для извлечения квадратного корня.
'''

a = 5
b = 10
c = 200

D = complex(b**2 - 4*a*c, 0)
x1 = (-b + D**0.5)/(2*a)
x2 = (-b - D**0.5)/(2*a)
print(D, x1, x2)

# D = b**2 - 4 * a * c

# if D >= 0:
#     x1 = (-b - D**0.5)/(2*a)
#     x2 = (-b + D**0.5)/(2*a)
# else:
#     D = complex(D)
#     x1 = (-b - D**0.5)/(2*a)
#     x2 = (-b + D**0.5)/(2*a)

# print(x1, x2)
